Revit 2027 API
ExternalFileReference.ExternalFileReferenceType Property
 The type of external file which this object references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalFileReferenceType ExternalFileReferenceType { get; }
Public ReadOnly Property ExternalFileReferenceType As ExternalFileReferenceType
	Get
public:
property ExternalFileReferenceType ExternalFileReferenceType {
	ExternalFileReferenceType get ();
}
member ExternalFileReferenceType : ExternalFileReferenceType with get
Property Value
ExternalFileReferenceType
See Also
Reference
ExternalFileReference Class
Autodesk.Revit.DB Namespace